blog/remote-state-en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-17 Wed 09:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terraform Remote State on S3</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Colin" />
<link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Terraform Remote State on S3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf43455a">1. S3 Bucket Creation</a></li>
<li><a href="#org777281b">2. Use the S3 Backend</a></li>
<li><a href="#org28d6ad4">3. References</a></li>
</ul>
</div>
</div>
<p>
The <a href="https://www.terraform.io/docs/backends/types/s3.html">official S3 backend documentation</a> for Terraform gives the impression that
Remote State is more involved than it actually needs to be. In this post, I give
an example of the most concise possible Terraform configuration that enables
Remote State on S3.
</p>

<p>
Note that I don't explain how to implement "State Locking", although the blog
post that I referenced (linked below) does demonstrate this.
</p>

<div id="outline-container-orgf43455a" class="outline-2">
<h2 id="orgf43455a"><span class="section-number-2">1</span> S3 Bucket Creation</h2>
<div class="outline-text-2" id="text-1">
<p>
We do this with Terraform as well. In a directory <i>separate</i> from the project
you wish to enable Remote State for, produce the following:
</p>

<div class="org-src-container">
<pre class="src src-terraform"><span style="color: #2aa1ae; background-color: #ecf3ec;"># The variables here should live in a `variables.tf` file as usual, with their</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># true values defined in some uncommitted `terraform.tfvars` file.</span>
<span style="color: #6c3163; font-weight: bold;">provider</span> <span style="color: #2d9574;">"aws"</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #715ab1;">access_key</span> = <span style="color: #2d9574;">"</span><span style="color: #715ab1;">${var.access_key}</span><span style="color: #2d9574;">"</span>
  <span style="color: #715ab1;">secret_key</span> = <span style="color: #2d9574;">"</span><span style="color: #715ab1;">${var.secret_key}</span><span style="color: #2d9574;">"</span>
  <span style="color: #715ab1;">region</span>     = <span style="color: #2d9574;">"us-east-2"</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># This can be whatever you want.</span>
  <span style="color: #715ab1;">version</span>    = <span style="color: #2d9574;">"~&gt; 2.2"</span>
<span style="color: #3a81c3;">}</span>

<span style="color: #6c3163; font-weight: bold;">resource</span> <span style="color: #2d9574;">"aws_s3_bucket"</span> <span style="color: #2d9574;">"tf-state-storage"</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># Must be globally unique.</span>
  <span style="color: #715ab1;">bucket</span> = <span style="color: #2d9574;">"your-bucket-name"</span>

  <span style="color: #2aa1ae; background-color: #ecf3ec;"># This allows you to roll back in the case of errors.</span>
  <span style="color: #ba2f59; font-weight: bold;">versioning</span> <span style="color: #6c3163;">{</span>
    <span style="color: #715ab1;">enabled</span> =<span style="color: #4e3163;"> true</span>
  <span style="color: #6c3163;">}</span>

  <span style="color: #ba2f59; font-weight: bold;">lifecycle</span> <span style="color: #6c3163;">{</span>
    <span style="color: #715ab1;">prevent_destroy</span> =<span style="color: #4e3163;"> true</span>
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Then <code>terraform init</code> and <code>terraform apply</code> as usual. <i>This</i> state will be local
to your machine, but since it's just one resource, that's fine.
</p>
</div>
</div>

<div id="outline-container-org777281b" class="outline-2">
<h2 id="org777281b"><span class="section-number-2">2</span> Use the S3 Backend</h2>
<div class="outline-text-2" id="text-2">
<p>
Within the main <code>.tf</code> file of your real project, prepend the following:
</p>

<div class="org-src-container">
<pre class="src src-terraform"><span style="color: #2aa1ae; background-color: #ecf3ec;"># This cannot contain variable expansions.</span>
<span style="color: #ba2f59; font-weight: bold;">terraform</span> <span style="color: #3a81c3;">{</span>
  backend <span style="color: #2d9574;">"s3"</span> <span style="color: #6c3163;">{</span>
    <span style="color: #715ab1;">encrypt</span> =<span style="color: #4e3163;"> true</span>

    <span style="color: #2aa1ae; background-color: #ecf3ec;"># Same as the bucket we just created.</span>
    <span style="color: #715ab1;">bucket</span> = <span style="color: #2d9574;">"your-bucket-name"</span>

    <span style="color: #2aa1ae; background-color: #ecf3ec;"># The name of the state file that will appear in S3.</span>
    <span style="color: #715ab1;">key</span> = <span style="color: #2d9574;">"foobar.tfstate"</span>

    <span style="color: #2aa1ae; background-color: #ecf3ec;"># The region of the S3 bucket, NOT the region of the other resources in this</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># module!</span>
    <span style="color: #715ab1;">region</span> = <span style="color: #2d9574;">"us-east-2"</span>
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
This is a "partial configuration", because we haven't supplied the <code>access_key</code>
and <code>secret_key</code> that were used to create the bucket (and set its access
controls). You thus also need some file, named say <code>conf.conf</code> which contains
these fileds in the form:
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #715ab1;">access_key</span> = <span style="color: #2d9574;">"YOUR-AWS-ACCESS-KEY"</span>
<span style="color: #715ab1;">secret_key</span> = <span style="color: #2d9574;">"YOUR-AWS-SECRET-KEY"</span>
</pre>
</div>

<p>
Now, <code>terraform init --backend-config=conf.conf</code> will reconfigure your project
to save its state to the S3 bucket. If you already had some local state, it will
be uploaded now.
</p>

<p>
Further applications of <code>terraform apply</code>, <code>terraform destroy</code>, etc., will
push/pull results from S3 as desired. Mission accomplished!
</p>
</div>
</div>

<div id="outline-container-org28d6ad4" class="outline-2">
<h2 id="org28d6ad4"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Medium: <a href="https://medium.com/swlh/https-medium-com-sahityamaruvada-setting-up-terraform-remote-state-azure-aws-e936a48f672b">Setting up Terraform Remote State</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-07-17</p>
<p class="author">Author: Colin</p>
<p class="date">Created: 2019-07-17 Wed 09:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
